Revit.AnalysisDisplay.PointAnalysisDisplay
A Revit Point Analysis Display

Revit.AnalysisDisplay.PointAnalysisDisplay.#ctor(Autodesk.Revit.DB.View,Analysis.PointData,System.String,System.String,System.Type)
Create a Point Analysis Display in the current view
view:
sampleLocations:
samples:
data:
resultsName:
description:
unitType:

Revit.AnalysisDisplay.PointAnalysisDisplay.InternalSetSpatialFieldValues(Analysis.IStructuredData{Autodesk.DesignScript.Geometry.Point,System.Double},System.Collections.Generic.List{System.Int32}@,System.String,System.String,System.Type)
Set the spatial field values for the current spatial field primitive.  The two
input sequences should be of the same length.
pointLocations:
values:
data:
primitiveIds:
schemaName:
description:
unitType:

Revit.AnalysisDisplay.PointAnalysisDisplay.ByViewPointsAndValues(Revit.Elements.Views.View,Autodesk.DesignScript.Geometry.Point[],System.Double[],System.String,System.String,System.Type)
Show a colored Point Analysis Display in the Revit view.
view: The view into which you want to draw the analysis results.
sampleLocations: The locations at which you want to create analysis values.
samples: The analysis values at the given locations.
name: An optional analysis results name to show on the results legend.
description: An optional analysis results description to show on the results legend.
unitType: An optional Unit type to provide conversions in the analysis results.
Returns: An PointAnalysisDisplay object.

Revit.AnalysisDisplay.PointAnalysisDisplay.ByViewAndPointAnalysisData(Revit.Elements.Views.View,Analysis.PointData,System.String,System.String,System.Type)
Show a colored Point Analysis Display in the Revit view.
view: The view into which you want to draw the analysis results.
data: A list of PointData objects.
name: An optional analysis results name to show on the results legend.
description: An optional analysis results description to show on the results legend.
unitType: An optional Unit type to provide conversions in the analysis results.
Returns: An PointAnalysisDisplay object.